{
  "step0": {
    "title": "Introduction to Staking",
    "content": [
      "Staking in Ethereum 2.0 is the process of actively participating in transaction validation (similar to mining) on the Ethereum blockchain. Here's what you need to know:",
      {
        "type": "list",
        "items": [
          "Validators are chosen to create new blocks and validate transactions.",
          "To become a validator, you need to stake at least 32 ETH.",
          "Validators earn rewards for helping to secure the network."
        ]
      },
      "In this demo, we've pre-generated 15 validators to show how the network might look. The pie chart and table show the distribution of stakes among these validators.",
      "Reward Calculation:",
      "The validator's reward is calculated based on several factors:",
      {
        "type": "list",
        "items": [
          "The validator's effective balance (capped at 32 ETH)",
          "The total value locked (TVL) in the network",
          "A base reward rate",
          "Additional rewards for finality",
          "Potential penalties for misbehavior"
        ]
      },
      "The actual reward can vary based on network conditions and validator performance. The simulation below gives an estimate of potential earnings over time."
    ]
  },
  "step1": {
    "title": "Becoming a Validator",
    "content": [
      "To become a validator, you need to complete these steps:",
      {
        "type": "orderedList",
        "items": [
          "Stake at least 32 ETH",
          "Generate a withdrawal address",
          "Create a RANDAO commitment",
          "Generate a validation code"
        ]
      },
      "The RANDAO commitment is calculated as:",
      {
        "type": "formula",
        "content": "R = H^n(\\text{secret phrase})"
      },
      "Where H is the hash function, and n is the number of blocks to validate.",
      "RANDAO Generation Process:",
      "The RANDAO commitment is calculated through repeated hashing of your secret phrase. Each step in the animation represents one round of hashing, demonstrating how the final commitment is derived from your initial input."
    ]
  },
  "step2": {
    "title": "Congratulations!",
    "content": [
      "You've successfully become a validator. Your contribution helps secure the Ethereum network and maintain its decentralized nature.",
      "The values you've generated (RANDAO commitment, validation code, etc.) are used in the validation process to ensure the integrity and security of the network."
    ]
  },
  "validatorSelection0": {
    "title": "RANDao Unrolling",
    "content": [
      "RANDao (Random Decentralized Autonomous Organization) is a mechanism used in Ethereum 2.0 to generate randomness for validator selection.",
      "The process of RANDao unrolling involves:",
      {
        "type": "orderedList",
        "items": [
          "Starting with a secret phrase provided by the validator",
          "Repeatedly hashing this phrase a specified number of times",
          "The final hash becomes the RANDao commitment"
        ]
      },
      "This process ensures that the randomness is unpredictable and cannot be manipulated by validators."
    ]
  },
  "validatorSelection1": {
    "title": "Global XOR Calculation",
    "content": [
      "The Global XOR (eXclusive OR) calculation is a crucial step in combining individual validator randomness with the global randomness of the Ethereum network.",
      "The process involves:",
      {
        "type": "orderedList",
        "items": [
          "Taking the final RANDao commitment from the previous step",
          "XORing it with the current global randomness value",
          "The result becomes the seed for validator selection"
        ]
      },
      "XOR operation ensures that even if one input is predictable, the output remains random as long as the other input is random.",
      "For illustration purposes, we're showing the XOR process with shortened hashes. In practice, the full 256-bit (64 hexadecimal characters) hashes are used.",
      "The color coding in the binary representation shows where the bits match (green) or differ (red). The XOR result has a '1' wherever the inputs differ, and '0' where they match.",
      "This method of combining randomness sources helps prevent any single validator from manipulating the selection process, as they cannot predict or control the global RANDAO value."
    ]
  },
  "validatorSelection2": {
    "title": "Validator Selection",
    "content": [
      "The final step in the process is selecting a validator based on the random seed generated in the previous steps.",
      "Key points of this process:",
      {
        "type": "list",
        "items": [
          "Validators are selected probabilistically based on their stake",
          "Higher stake increases the chance of selection, but doesn't guarantee it",
          "This method ensures fairness while also incentivizing higher stakes"
        ]
      },
      "The selection process maintains the security and decentralization of the Ethereum network by preventing any single entity from controlling the validation process."
    ]
  },
  "blockCreation0": {
    "title": "Block Proposal",
    "content": [
      "Block proposal is the first step in creating a new block in the Ethereum blockchain. Here's what happens during this phase:",
      {
        "type": "list",
        "items": [
          "The selected validator prepares a new block.",
          "Transactions from the mempool are selected and included in the block.",
          "The validator calculates the new state root after applying these transactions.",
          "A block header is created, including metadata like the block number, timestamp, and previous block's hash.",
          "The proposed block is then broadcast to other validators for attestation."
        ]
      },
      "This process ensures that new transactions are added to the blockchain in an orderly and secure manner."
    ]
  },
  "blockCreation1": {
    "title": "Block Attestation",
    "content": [
      "Block attestation is the process where other validators confirm the validity of the proposed block. Key points include:",
      {
        "type": "list",
        "items": [
          "Validators check that the block proposal follows the protocol rules.",
          "They verify the transactions and state transitions in the block.",
          "If valid, validators sign an attestation to the block.",
          "These attestations are collected and will be included in future blocks."
        ]
      }
    ]
  },
  "blockCreation2": {
    "title": "Block Aggregation",
    "content": [
      "Block aggregation involves collecting and combining attestations from multiple validators. This step is crucial for efficiency and scalability:",
      {
        "type": "list",
        "items": [
          "Attestations from different validators are gathered.",
          "These attestations are compressed and aggregated into a single signature.",
          "This aggregation significantly reduces the amount of data that needs to be stored on the blockchain.",
          "It allows for a large number of validators to participate without overwhelming the network."
        ]
      }
    ]
  },
  "blockCreation3": {
    "title": "Incorporation into Chain",
    "content": [
      "The final step is incorporating the new block into the blockchain:",
      {
        "type": "list",
        "items": [
          "Once a block has received sufficient attestations, it's considered confirmed.",
          "The block is added to the canonical chain.",
          "The network state is updated to reflect the new block.",
          "Validators start working on the next block, building on top of this newly added one."
        ]
      },
      "This process ensures the continuous growth and security of the Ethereum blockchain."
    ]
  },
  "finalityAndChainSelection": {
    "forksAndDivergingChains": {
      "title": "Forks & Diverging Chains",
      "content": [
        "In a decentralized network like Ethereum, multiple validators may propose blocks simultaneously, leading to temporary forks in the blockchain.",
        "These forks create diverging chains, each with its own set of proposed blocks and associated validators.",
        "Understanding how these forks occur and are resolved is crucial to grasping the consensus mechanism of Ethereum's Proof of Stake."
      ]
    },
    "validatorBettingOverview": {
      "title": "Validator Betting Overview",
      "content": [
        "In this step, validators decide how much they're willing to bet on their proposed chain.",
        "The betting process involves calculating potential gains (V_GAIN) and losses (V_LOSS) based on the validator's stake and chosen odds.",
        "Higher odds increase potential rewards but also increase risk. Validators must balance their confidence in the chain being finalized with the potential rewards and risks."
      ]
    },
    "otherValidatorsParticipate": {
      "title": "Other Validators Participate",
      "content": [
        "In this step, we simulate the participation of all the network validators in betting on the finalization of the chain. Each validator decides between the proposed chain and the competing chain.",
        {
          "type": "list",
          "items": [
            "The global randao value is shown at the top of the page. This value introduces randomness, ensuring that the betting decisions are fair and unbiased.",
            "Each validator has a unique randao reveal, which they use in combination with the global randao value through an XOR operation to generate randomness.",
            "This XOR operation between the global randao and each validator's randao reveal ensures an unbiased result when selecting the chain to bet on.",
            "Validators make their decisions based on their confidence in the chain being finalized. This confidence is influenced by the odds and their own stake."
          ]
        },
        "The number of validators supporting each chain is displayed at the top, along with their total staked ETH backing each chain. The randomness used here is crucial for maintaining the fairness of the blockchain's finality mechanism."
      ]
    }
  },
  "economicsFeesAndPenalties": {
    "step1": {
      "title": "Transaction Fees",
      "content": [
        "Transaction fees in Ethereum consist of two parts:",
        {
          "type": "list",
          "items": [
            "Base Fee: This is burned (removed from circulation), reducing ETH supply.",
            "Priority Fee (Tip): This goes to the validator as an incentive for faster processing."
          ]
        },
        "The fee structure helps maintain network security and manage congestion.",
        "Validators are incentivized to include transactions with higher tips, ensuring efficient processing of high-priority transactions."
      ]
    },
    "step2": {
      "title": "Block Rewards",
      "content": [
        "Block rewards incentivize validators to participate in the network.",
        "We'll explore how these rewards are calculated and distributed."
      ]
    },
    "step3": {
      "title": "Penalties and Slashing",
      "content": [
        "To maintain network security, Ethereum implements penalties for misbehaving validators.",
        "We'll examine how these penalties work and what actions can lead to slashing of a validator's stake."
      ]
    }
  }
}
