{
  "Section_Introduction": {
    "title": "Introduction to Ethereum Proof of Stake Demo",
    "content": [
      "Hello!",
      "This project is an interactive demonstration of key principles behind Ethereum 2.0 Proof of Stake mechanism.",
      "It is based on the Ethereum Mauve Paper by Vitalik Buterin and includes almost all its sections, ideas and formulas.",
      "**How to use?**",
      "- The project is designed to be viewed in an ordered way, section by section. Press “Next” and “Go to next section” buttons in the bottom right corner when you’ve finished the step.\n- The text in the sidebar contains my notes that I hope help understand what’s going on at every stage. Make sure to read through it any time you didn’t get something from the visualisations.",
      "**Before you press start, please note:**",
      "1. This is an educational website. It is not decentralised, or scalable, or realistic. It’s goal is to explain how Ethereum works to almost anyone interested.\n2. This website is frontend-only. All data is generated and calculated right in your browser.\n3. It should be adaptive, but because it features lots of JS and is built in horizontal format, I recommend viewing it on your computer.\n4. This website is a first pet project of mine. So it might break occasionally (though I tested it), or feature some bugs, or be displayed not in the best way on your screen resolution. Sorry!",
      "If you’d like to learn more about the project, follow the links below:",
      "- [Medium blog post about how and why this was made](#)\n- [A GitHub repo](#)\n- if you want to suggest an edit, donate or ask me anything: tim.sha256@gmail.com"
    ]
  },
  "Section_StakingOverview": {
    "steps": {
      "Step_Overview": {
        "title": "Introduction to Staking",
        "content": [
          "The topic of this project is the **Proof of Stake (PoS)** - a consensus mechanism in Ethereum 2.0.", 
          "A consensus mechanism is a way to ensure trust and decisionmaking in a decentralised network like Ethereum - where there’s no authority, regulator or governor.",
          "Staking in Ethereum 2.0 is the process of actively participating in transaction validation (similar to mining) on the Ethereum blockchain.",
          {
            "type": "list",
            "items": [
              "Validators are nodes in the blockchain chosen to create new blocks and validate transactions.",
              "Validators earn rewards for helping to secure the network - this is Staking.",
              "In this demo, I’ve pre-generated 15 validators to show how the network might look. The pie chart and table show the distribution of stakes among these validators. Please note that in the real ETH blockchain there are dozens of thousands validators, not 15."
            ]
          },
          "**Each validator has a list of features:**",
          {
            "type": "list",
            "items": [
              "Stake amount (in ETH)",
              "Validation code - a mix of public keys and other parameters, used to verify the validator.",
              "Randao commitment - a pseudo-random value. More about it in the next step",
              "Withdrawal address - validator’s wallet address"
            ]
          }
        ]
      },
      "Step_StakingInput": {
        "title": "Staking Input",
        "content": [
          "To become a validator, you need to complete these steps:",
          {
            "type": "orderedList",
            "items": [
              "Stake at least 32 ETH (for best visualisation, set it to 100-500)",
              "Get a withdrawal address (we’ll generate a random one)",
              "Create a RANDAO commitment",
              "Generate a validation code"
            ]
          },
          "The RANDAO commitment is a pseudo-random value based on a secret phrase of your choice.",
          "The chosen phrase is hashed repeatedly for a number of times equal to the amount of blocks you’d like to validate. We’ll explain its meaning in the next section.",
          "Each step in the animation represents one round of hashing, demonstrating how the final result is derived from your initial input.",
          {
            "type": "formula",
            "content": "R = H^n(\\text{secret phrase})"
          },
          "Where H is the hash function, and n is the number of blocks to validate."
        ]
      },
      "Step_Summary": {
        "title": "Summary",
        "content": [
          "**Congratulations!**",
          "You've successfully become a validator. Your contribution helps secure the Ethereum network and maintain its decentralized nature.",
          "You can now find yourself in the pie chart and table below it.",
          "The values you've generated (RANDAO commitment, validation code, etc.) were sent to the Casper Contract, one of the main contracts in Ethereum that keeps the list of validators, and are used in the validation process to ensure the integrity and security of the network. But more on that in the next section!"
        ]
      }
    }
  },

  "Section_ValidatorSelection": {
    "steps": {
      "Step_RandaoUnrolling": {
        "title": "RANDao Unrolling",
        "content": [
          "Remember how you'd created your own RANDAO value?",
          "The idea behind it is that hash function is a one-side function: you can't derive the original secret phrase or even a value from the previous hashing step from the final value.",
          "You can read more about hashing functions [here](https://www.geeksforgeeks.org/introduction-to-hashing-2/).",
          "But, if you have the value from the previous step, and hash it once again - it will be equal to the final value.",
          "RANDAO is a way for the Ethereum Casper Contract and other nodes to validate that **you are really you**: with each block you validate, you submit the value from the previous hashing step (Unrolled RANDAO), and by hashing it and comparing it to your RANDAO commitment, others can check if you're legit without knowing your secret phrase.",
          "Now you know why you needed to set the number of steps in the previous section - this process is not endless, and when you unroll your Randao for the last time, you can't validate new blocks anymore - there's only the secret phrase left.",
          "That's why validators in the real network hash the secret phrase for thousands of times in order to validate more blocks with time.",
          "Let's unroll your RANDAO by re-calculating it from scratch:",
          {
            "type": "orderedList",
            "items": [
              "Starting with a secret phrase you provided",
              "Repeatedly hashing this phrase $N-1$ times, where $N$ is the number of steps you chose previously."
            ]
          },
          "With each next block, we'll be doing one step less: $N-2$, $N-3$, …"
        ]
      },
      "Step_XorCalculation": {
        "title": "Global XOR Calculation",
        "content": [
          "This is a very important step that shows another purpose of the RANDAO commitment.",
          "The thing is, you can't ensure real randomness inside of the blockchain, because it's state is fully deterministic: the code in the smart contracts, which the Ethereum is built with, can't google or secretly generate some value without others knowing the source of randomness.",
          "You can read more about randomness in blockchains [here](https://chain.link/education-hub/randomness-web3).",
          "The only way to use real randomness in the blockchain is by using an oracle, or a network of oracles.",
          "But let's not dive in it, since Ethereum relies on another kind of randomness - the **pseudo-randomness**.",
          "The idea behind using pseudo-random values to make \"random\" decisions in Ethereum is quite logical:",
          {
            "type": "list",
            "items": [
              "Every time they are selected to validate a block, validators can provide a new pseudorandom Unrolled RANDAO, which is unpredictable to others since they don't know the secret phrase. This is the first source of (pseudo) randomness.",
              "The casper contract holds a Global Randao value in it, initially set to 0. The Global Randao is known to everyone and changes with every block created. This is an another source of pseudo-randomness. It is calculated by combining the previous Global Randao with validator's Unrolled Randao, using a XOR function: [read more about XOR here](https://en.wikipedia.org/wiki/XOR_gate)."
            ]
          },
          "XOR is very simple:",
              "- Two values in binary form are compared bit-by-bit",
              "- If the bits are same (1 and 1 or 0 and 0), the resulting bit is 0, otherwise it's 1.",
              "XORing is also a one-side operation - you can't derive the two original values from it.",
          "This method of combining randomness sources helps prevent any single validator from manipulating the selection process, as they cannot predict or control the global RANDAO value.",
          "Note:",
          {
            "type": "list",
            "items": [
              "For illustration purposes, we're showing the XOR process with shortened hashes. In practice, the full 256-bit (64 hexadecimal characters) hashes are used.",
              "The color coding in the binary representation shows where the bits match (green) or differ (red). The XOR result has a '1' wherever the inputs differ, and '0' where they match."
            ]
          }
        ]
      },
      "Step_ValidatorSelectionVisualization": {
        "title": "Validator Selection",
        "content": [
          "Finally, we can now select a validator of the next block, using the psedo-random value from the previous step.",
          "**How it works:**",
          {
            "type": "orderedList",
            "items": [
              "New Global Randao from the previous step is used to generate a pseudo-random number, valued between 0 and 1. This is done by simply dividing the Global Randao in decimal form by $2^{53} - 1$. The resulting value is abbreviated as $r$.", "This $2^{53} - 1$ value ensures that the resulting r is always a probabilistic measure between 0 and 1. If you are interested in the reason for choosing the specific value - read about it [here](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Number/MAX_SAFE_INTEGER). Spoiler: it's complex and not necessary to know in the Ethereum context.",
              "This new number $r$ is then multiplied by the TVL - the total amount of Ethereum staked by all validators.",
              "Each validator's stake is presented on the chart in a \"ladder\" format - the whole TVL is broken down into separate stakes. To choose the validator, we place the $r*TVL$ value on the chart, and then check which validator's stake it falls into."
            ]
          },
          "**Key points of this process:**",
          {
            "type": "list",
            "items": [
              "Validators are selected probabilistically based on their stake",
              "Higher stake increases the chance of selection, but doesn't guarantee it",
              "This method ensures fairness while also incentivising higher stakes",
              "The selection process maintains the security and decentralization of the Ethereum network by preventing any single entity from controlling the validation process."
            ]
          }
        ]
      }
    }
  },
  "Section_BlockCreation": {
    "steps": {
      "Step_BlockProposal": {
        "title": "Block Proposal",
        "content": [
          "Block proposal is the first step in creating a new block in the Ethereum blockchain. Here's what happens during this phase:",
          {
            "type": "list",
            "items": [
              "The selected validator prepares a new block.",
              "Transactions from the mempool are selected and included in the block.",
              "The validator calculates the new state root after applying these transactions.",
              "A block header is created, including metadata like the block number, timestamp, and previous block's hash.",
              "The proposed block is then broadcast to other validators for attestation."
            ]
          },
          "This process ensures that new transactions are added to the blockchain in an orderly and secure manner."
        ]
      },
      "Step_BlockAttestation": {
        "title": "Block Attestation and Aggregation",
        "content": [
          "Block attestation is the process where other validators confirm the validity of the proposed block. Key points include:",
          {
            "type": "list",
            "items": [
              "Validators check that the block proposal follows the protocol rules.",
              "They verify the transactions and state transitions in the block.",
              "If valid, validators sign an attestation to the block.",
              "These attestations are collected and will be included in future blocks."
            ]
          },
          "Block aggregation involves collecting and combining attestations from multiple validators. This step is crucial for efficiency and scalability:",
          {
            "type": "list",
            "items": [
              "Attestations from different validators are gathered.",
              "These attestations are compressed and aggregated into a single signature.",
              "This aggregation significantly reduces the amount of data that needs to be stored on the blockchain.",
              "It allows for a large number of validators to participate without overwhelming the network."
            ]
          }
        ]
      },
      "Step_IncorporationIntoChain": {
        "title": "Incorporation into Chain",
        "content": [
          "The final step is incorporating the new block into the blockchain:",
          {
            "type": "list",
            "items": [
              "Once a block has received sufficient attestations, it's considered confirmed.",
              "The block is added to the canonical chain.",
              "The network state is updated to reflect the new block.",
              "Validators start working on the next block, building on top of this newly added one."
            ]
          },
          "This process ensures the continuous growth and security of the Ethereum blockchain."
        ]
      }
    }
  },
  "Section_FinalityAndChainSelection": {
    "steps": {
      "Step_ForksAndDivergingChains": {
        "title": "Forks & Diverging Chains",
        "content": [
          "In blockchain networks, forks can occur when two or more blocks are produced at the same height, creating diverging chains.",
          "Key points about forks:",
          {
            "type": "list",
            "items": [
              "Forks can happen due to network latency or malicious actors",
              "They create temporary uncertainty about the true state of the blockchain",
              "Ethereum's consensus mechanism is designed to resolve these forks quickly"
            ]
          },
          "The visualization shows how chains can diverge and how the network eventually agrees on a single canonical chain."
        ]
      },
      "Step_ValidatorBettingOverview": {
        "title": "Validator Betting Overview",
        "content": [
          "In Ethereum's Proof of Stake, validators 'bet' on which chain they believe will become the canonical chain.",
          "This betting process:",
          {
            "type": "list",
            "items": [
              "Incentivizes validators to agree on the correct chain",
              "Helps quickly resolve forks",
              "Penalizes validators who bet on the wrong chain"
            ]
          },
          "The betting mechanism is a key part of Ethereum's security model, ensuring that it's economically advantageous for validators to act honestly."
        ]
      },
      "Step_OtherValidatorsParticipate": {
        "title": "Other Validators Participate",
        "content": [
          "Once a validator has placed their bet, other validators in the network also participate in the betting process.",
          "This step demonstrates:",
          {
            "type": "list",
            "items": [
              "How multiple validators contribute to the consensus",
              "The accumulation of bets on different chain possibilities",
              "The emergence of a clear 'winner' as more validators bet"
            ]
          },
          "This collective decision-making process helps ensure the network's security and stability."
        ]
      },
      "Step_ResultsRewardsAndPenalties": {
        "title": "Results, Rewards, and Penalties",
        "content": [
          "After the betting process, the network determines the canonical chain and distributes rewards and penalties.",
          "Key aspects of this step:",
          {
            "type": "list",
            "items": [
              "Validators who bet on the correct chain receive rewards",
              "Those who bet on incorrect chains may face penalties",
              "The size of rewards and penalties depends on various factors, including stake size and network conditions"
            ]
          },
          "This system of rewards and penalties is crucial for maintaining the integrity of the Ethereum network, as it provides strong economic incentives for honest behavior."
        ]
      }
    }
  },
  "Section_EconomicsFeesAndPenalties": {
    "steps": {
      "Step_Introduction": {
        "title": "Introduction to Economics, Fees, and Penalties",
        "content": [
          "In this section, we'll explore the economic aspects of Ethereum's Proof of Stake system, including transaction fees, block rewards, and penalties for misbehaving validators.",
          "Understanding these economic incentives is crucial for grasping how Ethereum maintains its security and efficiency in a decentralized manner.",
          "We'll cover three main topics:",
          {
            "type": "list",
            "items": [
              "Transaction Fees: How users pay for network usage",
              "Block Rewards: Incentives for validators to secure the network",
              "Penalties and Slashing: Consequences for malicious or negligent behavior"
            ]
          },
          "Each of these components plays a vital role in Ethereum's economic model, ensuring the network remains secure, efficient, and decentralized."
        ]
      },
      "Step_TransactionFees": {
        "title": "Transaction Fees",
        "content": [
          "Transaction fees in Ethereum consist of two parts:",
          {
            "type": "list",
            "items": [
              "Base Fee: This is burned (removed from circulation), reducing ETH supply.",
              "Priority Fee (Tip): This goes to the validator as an incentive for faster processing."
            ]
          },
          "The fee structure helps maintain network security and manage congestion.",
          "Validators are incentivized to include transactions with higher tips, ensuring efficient processing of high-priority transactions."
        ]
      },
      "Step_BlockRewards": {
        "title": "Block Rewards",
        "content": [
          "Block rewards are the primary incentive for validators to participate in the Ethereum network.",
          "Key points about block rewards:",
          {
            "type": "list",
            "items": [
              "Rewards are given for proposing and attesting to blocks",
              "The reward amount is calculated based on the validator's effective balance and overall network participation",
              "Rewards help offset the costs of running validator hardware and encourage long-term network security"
            ]
          },
          "Understanding block rewards is crucial for potential validators to assess the economic viability of participating in the network."
        ]
      },
      "Step_PenaltiesAndSlashing": {
        "title": "Penalties and Slashing",
        "content": [
          "To maintain network security and incentivize proper behavior, Ethereum implements a system of penalties and slashing for validators.",
          "Key aspects of this system include:",
          {
            "type": "list",
            "items": [
              "Minor penalties for being offline or missing attestations",
              "Severe slashing penalties for provably malicious behavior, such as double signing",
              "Correlation penalties that increase slashing severity if multiple validators are slashed at once"
            ]
          },
          "This system of penalties and slashing is designed to make attacks on the network economically infeasible and to encourage validators to maintain high uptime and follow the protocol rules."
        ]
      }
    }
  },
  "Section_LightClientSyncing": {
    "title": " ",
    "content": []
  },
  "Section_ShardingAndCrossShard": {
    "steps": {
      "Step_ShardModelOverview": {
        "title": "Shard Model Overview",
        "content": [
          "Sharding divides the Ethereum network into smaller parts called shards.",
          "This allows for parallel processing of transactions, increasing overall network capacity.",
          {
            "type": "list",
            "items": [
              "Improves scalability",
              "Maintains decentralization",
              "Reduces network congestion"
            ]
          }
        ]
      },
      "Step_ValidatorAssignment": {
        "title": "Validator Assignment",
        "content": [
          "Validators are randomly assigned to different shards.",
          "Random assignment enhances network security by preventing targeted attacks.",
          {
            "type": "list",
            "items": [
              "Ensures fair distribution of validators",
              "Maintains shard integrity",
              "Prevents shard dominance"
            ]
          }
        ]
      },
      "Step_CrossShardCommunication": {
        "title": "Cross-Shard Communication",
        "content": [
          "Shards can communicate and share information using a log-based system.",
          "Shard 0 plays a special role in managing cross-shard finality.",
          {
            "type": "list",
            "items": [
              "Uses ETHLOG and GETLOG opcodes",
              "Enables complex multi-shard transactions",
              "Ensures network cohesion"
            ]
          }
        ]
      }
    }
  },
  "Section_Conclusion": {
    "title": "Conclusion and Reference List",
    "content": [
      "Congratulations on completing the Ethereum Proof of Stake MVP tutorial!",
      "You've now gained insights into the core components of Ethereum's PoS system, from staking to sharding.",
      "For further reading and references, please check the list below:",
      {
        "type": "list",
        "items": [
          "Ethereum 2.0 Specifications: https://github.com/ethereum/consensus-specs",
          "Ethereum Foundation Blog: https://blog.ethereum.org/",
          "Ethereum Improvement Proposals (EIPs): https://eips.ethereum.org/",
          "Vitalik Buterin's Website: https://vitalik.ca/",
          "Ethereum Research Forum: https://ethresear.ch/",
          "Ethereum Stack Exchange: https://ethereum.stackexchange.com/"
        ]
      },
      "We hope this tutorial has been informative and has helped you understand the intricacies of Ethereum's Proof of Stake system. As the Ethereum ecosystem continues to evolve, stay curious and keep learning!"
    ]
  }
}
